Returns the geometric curve object corresponding to the node.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  Since:  2016
 Syntax
  C#
public Curve GetCurve()
  Visual Basic
Public Function GetCurve As Curve
  Visual C++
public:
Curve^ GetCurve()
 Return Value
 The curve.
 See Also
  CurveNode Class
  Autodesk.Revit.DB Namespace